/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   13_atoi.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tphoonsi <tphoonsi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/08/24 13:10:02 by tphoonsi          #+#    #+#             */
/*   Updated: 2024/08/31 15:47:11 by tphoonsi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_atoi(const char *str)
{
	long	res;
	int		sign;

	res = 0;
	sign = 1;
	while (*str == ' ' || (*str >= 9 && *str <= 13))
		str++;
	if (*str == '-' || *str == '+')
	{
		if (*str == '-')
			sign = -1;
		str++;
	}
	while (*str >= '0' && *str <= '9')
	{
		res = res * 10 + (*str - '0');
		str++;
	}
	return ((int)(res * sign));
}
/*
str++; ในเงื่อนไข if นั้นไว้สำหรับการเลื่อนตำแหน่งถัดไปแค่1ตัว
เพราะเมื่อเราเจอสัญลักษณ์ที่ตรงกับเงื่อนไขifเราเปลี่ยนค่าsign หรืออาจจะไม่
ทีนี้ก็สั่งให้ตัวพ้อยเตอร์ชี้ไปยังตำแหน่งถัดไป
และหลังจากนั้นก็วนเข้าไปลูปwhileในเงื่อนไขถัดไป
การทำงานของลูป
ในฟังก์ชั่นatoi สมมุติว่าสตริง "123"
while (*str >= '0' && *str <= '9')
	{
		res = res * 10 + (*str - '0');
		str++;
	}
res = res * 10 + (*str - '0')
res = 0 * 10 + ('1' - '0')
res = 0 + (49 - 48)
res = 0 + 1
Result: res = 1
-----------
res = res * 10 + (*str - '0')
res = 1 * 10 + ('2' - '0')
res = 10 + (50 - 48)
res = 10 + 2
Result: res = 12
-----------
res = res * 10 + (*str - '0')
res = 12 * 10 + ('3' - '0')
res = 120 + (51 - 48)
res = 120 + 3
Result: res = 123
*/
