/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_calloc.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tphoonsi <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/08/28 12:53:26 by tphoonsi          #+#    #+#             */
/*   Updated: 2024/09/10 15:06:58 by tphoonsi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	*ft_calloc(size_t count, size_t size)
{
	size_t	lenght;
	void	*ptr;

	lenght = size * count;
	if (count == 0 || size == 0)
		return (malloc(0));
	else if ((long)count < 0 || (long)size < 0)
		return (NULL);
	ptr = (void *)malloc(lenght);
	if (ptr == NULL)
		return (NULL);
	ft_bzero(ptr, lenght);
	return (ptr);
}

/*
ฟังก์ชั่นนี้ calloc ไว้ใช้ในการ "จองหน่วยความจำ"
ตามจำนวนที่ต้องการ (count) และขนาดของแต่ละหน่วย (size)

นอกจากนั้นยังเคลียร์ค่าในหน่วยความจำที่จองให้เป็น 0 ซึ่งเป็นสิ่งที่ต่างจาก malloc
int *arr = (int *)calloc(10, sizeof(int)); จะทำการจองหน่วยความจำและ
เคลียให้กลายเป็น 0 (ft_bzero)
*****แก้ไขเพิ่มเติมหลังจากส่งไม่ผ่าน*****
เพิ่มเงื่อนไขกรณีที่ไม่สามารถจองได้ กรณีที่ count == 0 || size == 0
ให้ทำการจองพื้นที่เป็น 0
และมีการกันข้อผิดพลาดภายนอกกรณีที่เป็นค่าติดลบ ให้return NULLออกไป
เพื่อป้องกันการจองพื้นที่ที่ไม่ถูกต้องและcount & sizeไม่สมเหตุสมผล
*/