/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_memmove.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tphoonsi <tphoonsi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/08/28 12:48:47 by tphoonsi          #+#    #+#             */
/*   Updated: 2024/09/07 16:29:58 by tphoonsi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	*ft_memmove(void *dest, const void *src, size_t n)
{
	unsigned char	*dst;
	unsigned char	*s;

	if (!dest && !src)
		return (0);
	dst = (unsigned char *)dest;
	s = (unsigned char *)src;
	if (dst < s)
	{
		while (n--)
			*dst++ = *s++;
	}
	else
	{
		dst += n;
		s += n;
		while (n--)
			*--dst = *--s;
	}
	return (dest);
}
/*
 n-- (Post-decrement)
n-- เป็นการลดค่าของ n ลง 1 หลังจาก ที่ได้ใช้ค่า n ในขณะนั้นแล้ว
while (n > 0) 
{
    *dst++ = *s++;
    n--;
}
กรณี dst อยู่ก่อน src (dst < src):

ข้อมูลจะถูกคัดลอกจากซ้ายไปขวา (จากตำแหน่งต้นทางไปยังตำแหน่งปลายทาง)
ใช้ลูปที่คัดลอกข้อมูลทีละบิตจากต้นทาง (src) 
ไปยังปลายทาง (dst) โดยเริ่มจากตำแหน่งแรก

กรณี dst อยู่หลัง src (dst > src):
ข้อมูลจะถูกคัดลอกจากขวาไปซ้าย(จากตำแหน่งสุดท้ายของช่วงข้อมูล
ไปยังตำแหน่งต้นของช่วงข้อมูล)
ใช้ลูปที่คัดลอกข้อมูลจากปลายทาง (dst) ไปยังต้นทาง (src) โดยเริ่มจากตำแหน่งสุดท้าย
โดยทั่วไปแล้ว:

if (dst < src): ใช้เมื่อ dst อยู่ก่อน src 
เพื่อให้แน่ใจว่าข้อมูลจะถูกคัดลอกจากซ้ายไปขวา
else: ใช้เมื่อ dst อยู่หลัง src เพื่อให้แน่ใจว่าข้อมูลจะถูกคัดลอกจากขวาไปซ้าย
ยกตัวอย่าง
สมมุติว่า char arr[14] = "Hello, World!"
char *dest = &arr[2]
int	n = 5;
dst += n ก็คือ W
และถ้า ft_memmove(str,str + 7,6);
output ก็จะได้ World!, World!
และถ้า ft_memmove(str + 7, str,5);
Hello, Hello!
ft_memove(ตัวเริ่มต้น, ตัวที่อยากเอามาใส่ตัวเริ่มต้น, จำนวนที่อยากเอา)
การทำงานสำหรับการทับซ้อน (overlap)
ถ้า dst อยู่ก่อน src กรณีที่ไม่ทับกันจะคัดลอกจากซ้ายไปขวา
ถ้า dst อยู่หลัง src กรณีที่ทับกัน จะคัดลอกขากขวาไปซ้าย
เอาสั้นๆสรุปคือ เขียนทับindexตัวนั้นไปเลย
*/
