/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_striteri.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tphoonsi <tphoonsi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/09/07 12:42:35 by tphoonsi          #+#    #+#             */
/*   Updated: 2024/09/07 14:43:46 by tphoonsi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	ft_striteri(char *s, void (*f)(unsigned int, char*))
{
	unsigned int	i;

	i = 0;
	if (!s || !f)
		return ;
	while (s[i])
	{
		f(i, s + i);
		i++;
	}
}
/*
"string iterate with index วนซ้ำสตริงพร้อมกับใช้ดัชนี"
เป็นฟังก์ชั่นเรียกฟังก์ชั่นเข้ามาทำเรื่อยๆจนถึง null และ
รับค่าพารามีเตอร์2แบบใน1อันส่วนอีกฝั่งคือstringหลักที่ต้องการอยาก
ทำการเปลี่ยนแปลง
ft_striteri วนซ้ำสตริง ไปจนถึงตัว null character
เรียกฟังก์ชันที่ส่งเข้าไป (callback function) ในทุกตัวอักษรในสตริง
พารามิเตอร์ที่ส่งเข้าไปใน callback function จะมี 2 แบบคือ
ดัชนีของตัวอักษร (index) และตัวอักษรนั้น ๆ
สตริงหลักที่ส่งเข้าไปคือสตริงที่เราต้องการทำการเปลี่ยนแปลง
*/